; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p1-2 - location
	p1-8 - location
	p2-5 - location
	p2-12 - location
	p3-4 - location
	p3-6 - location
	p3-10 - location
	p4-0 - location
	p5-4 - location
	p5-7 - location
	p5-11 - location
	p5-12 - location
	p6-0 - location
	p6-8 - location
	p6-10 - location
	p7-4 - location
	p7-9 - location
	p7-11 - location
	p8-1 - location
	p8-3 - location
	p9-3 - location
	p11-8 - location
	p11-12 - location
	p12-0 - location
	p12-8 - location
	)
	(:init
	(at driver1 s11)
	(at driver2 s1)
	(at driver3 s7)
	(at driver4 s10)
	(at truck1 s12)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s2)
	(at package2 s12)
	(at package3 s5)
	(at package4 s6)
	(at package5 s5)
	(at package6 s11)
	(at package7 s8)
	(at package8 s7)
	(at package9 s6)
	(at package10 s8)
	(at package11 s10)
	(at package12 s8)
	(at package13 s12)
	(at package14 s12)
	(at package15 s9)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 36)
	(= (time-to-walk p1-2 s1) 36)
	(= (time-to-walk s2 p1-2) 53)
	(= (time-to-walk p1-2 s2) 53)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 35)
	(= (time-to-walk p1-8 s1) 35)
	(= (time-to-walk s8 p1-8) 43)
	(= (time-to-walk p1-8 s8) 43)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 14)
	(= (time-to-walk p2-5 s2) 14)
	(= (time-to-walk s5 p2-5) 86)
	(= (time-to-walk p2-5 s5) 86)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(= (time-to-walk s2 p2-12) 54)
	(= (time-to-walk p2-12 s2) 54)
	(= (time-to-walk s12 p2-12) 73)
	(= (time-to-walk p2-12 s12) 73)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 30)
	(= (time-to-walk p3-4 s3) 30)
	(= (time-to-walk s4 p3-4) 92)
	(= (time-to-walk p3-4 s4) 92)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 26)
	(= (time-to-walk p3-6 s3) 26)
	(= (time-to-walk s6 p3-6) 12)
	(= (time-to-walk p3-6 s6) 12)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 42)
	(= (time-to-walk p3-10 s3) 42)
	(= (time-to-walk s10 p3-10) 93)
	(= (time-to-walk p3-10 s10) 93)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 26)
	(= (time-to-walk p4-0 s4) 26)
	(= (time-to-walk s0 p4-0) 50)
	(= (time-to-walk p4-0 s0) 50)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 77)
	(= (time-to-walk p5-4 s5) 77)
	(= (time-to-walk s4 p5-4) 64)
	(= (time-to-walk p5-4 s4) 64)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 73)
	(= (time-to-walk p5-7 s5) 73)
	(= (time-to-walk s7 p5-7) 43)
	(= (time-to-walk p5-7 s7) 43)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(= (time-to-walk s5 p5-11) 99)
	(= (time-to-walk p5-11 s5) 99)
	(= (time-to-walk s11 p5-11) 27)
	(= (time-to-walk p5-11 s11) 27)
	(path s5 p5-12)
	(path p5-12 s5)
	(path s12 p5-12)
	(path p5-12 s12)
	(= (time-to-walk s5 p5-12) 43)
	(= (time-to-walk p5-12 s5) 43)
	(= (time-to-walk s12 p5-12) 75)
	(= (time-to-walk p5-12 s12) 75)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 84)
	(= (time-to-walk p6-0 s6) 84)
	(= (time-to-walk s0 p6-0) 42)
	(= (time-to-walk p6-0 s0) 42)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(= (time-to-walk s6 p6-8) 98)
	(= (time-to-walk p6-8 s6) 98)
	(= (time-to-walk s8 p6-8) 37)
	(= (time-to-walk p6-8 s8) 37)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(= (time-to-walk s6 p6-10) 15)
	(= (time-to-walk p6-10 s6) 15)
	(= (time-to-walk s10 p6-10) 65)
	(= (time-to-walk p6-10 s10) 65)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(= (time-to-walk s7 p7-4) 1)
	(= (time-to-walk p7-4 s7) 1)
	(= (time-to-walk s4 p7-4) 51)
	(= (time-to-walk p7-4 s4) 51)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 17)
	(= (time-to-walk p7-9 s7) 17)
	(= (time-to-walk s9 p7-9) 36)
	(= (time-to-walk p7-9 s9) 36)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(= (time-to-walk s7 p7-11) 94)
	(= (time-to-walk p7-11 s7) 94)
	(= (time-to-walk s11 p7-11) 31)
	(= (time-to-walk p7-11 s11) 31)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 21)
	(= (time-to-walk p8-3 s8) 21)
	(= (time-to-walk s3 p8-3) 47)
	(= (time-to-walk p8-3 s3) 47)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 4)
	(= (time-to-walk p9-3 s9) 4)
	(= (time-to-walk s3 p9-3) 50)
	(= (time-to-walk p9-3 s3) 50)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(= (time-to-walk s11 p11-8) 39)
	(= (time-to-walk p11-8 s11) 39)
	(= (time-to-walk s8 p11-8) 29)
	(= (time-to-walk p11-8 s8) 29)
	(path s11 p11-12)
	(path p11-12 s11)
	(path s12 p11-12)
	(path p11-12 s12)
	(= (time-to-walk s11 p11-12) 62)
	(= (time-to-walk p11-12 s11) 62)
	(= (time-to-walk s12 p11-12) 80)
	(= (time-to-walk p11-12 s12) 80)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(= (time-to-walk s12 p12-0) 22)
	(= (time-to-walk p12-0 s12) 22)
	(= (time-to-walk s0 p12-0) 88)
	(= (time-to-walk p12-0 s0) 88)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(= (time-to-walk s12 p12-8) 30)
	(= (time-to-walk p12-8 s12) 30)
	(= (time-to-walk s8 p12-8) 98)
	(= (time-to-walk p12-8 s8) 98)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 51)
	(= (time-to-drive s7 s0) 51)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 2)
	(= (time-to-drive s11 s0) 2)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 41)
	(= (time-to-drive s6 s1) 41)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 49)
	(= (time-to-drive s8 s1) 49)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 29)
	(= (time-to-drive s1 s2) 29)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 84)
	(= (time-to-drive s4 s2) 84)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 23)
	(= (time-to-drive s6 s2) 23)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 12)
	(= (time-to-drive s8 s2) 12)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 25)
	(= (time-to-drive s0 s3) 25)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 21)
	(= (time-to-drive s1 s3) 21)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 49)
	(= (time-to-drive s2 s3) 49)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 40)
	(= (time-to-drive s11 s3) 40)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 86)
	(= (time-to-drive s3 s4) 86)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 49)
	(= (time-to-drive s2 s5) 49)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 91)
	(= (time-to-drive s3 s5) 91)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 3)
	(= (time-to-drive s9 s5) 3)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 84)
	(= (time-to-drive s10 s5) 84)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 84)
	(= (time-to-drive s11 s6) 84)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 34)
	(= (time-to-drive s1 s7) 34)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 4)
	(= (time-to-drive s2 s7) 4)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 30)
	(= (time-to-drive s3 s7) 30)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 37)
	(= (time-to-drive s4 s7) 37)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 54)
	(= (time-to-drive s8 s7) 54)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 69)
	(= (time-to-drive s11 s7) 69)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 66)
	(= (time-to-drive s5 s8) 66)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 15)
	(= (time-to-drive s9 s8) 15)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 48)
	(= (time-to-drive s11 s8) 48)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 87)
	(= (time-to-drive s1 s9) 87)
	(link s9 s12)
	(link s12 s9)
	(= (time-to-drive s9 s12) 2)
	(= (time-to-drive s12 s9) 2)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 77)
	(= (time-to-drive s6 s10) 77)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 85)
	(= (time-to-drive s12 s10) 85)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 52)
	(= (time-to-drive s9 s11) 52)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 79)
	(= (time-to-drive s12 s11) 79)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 25)
	(= (time-to-drive s2 s12) 25)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 1)
	(= (time-to-drive s3 s12) 1)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 7)
	(= (time-to-drive s8 s12) 7)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s11)
	(at driver3 s5)
	(at driver4 s0)
	(at truck1 s3)
	(at package1 s1)
	(at package2 s3)
	(at package3 s0)
	(at package4 s12)
	(at package5 s1)
	(at package6 s9)
	(at package7 s6)
	(at package8 s5)
	(at package9 s10)
	(at package10 s1)
	(at package11 s4)
	(at package12 s4)
	(at package13 s9)
	(at package14 s3)
	(at package15 s8)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver1 s11 p11-12)
   deleted: (at driver1 s11)
   added: (at driver1 p11-12)
   changed: (walked) from 0 to 62
   goals met: 0 of 20
2. (walk driver3 s7 p5-7)
   deleted: (at driver3 s7)
   added: (at driver3 p5-7)
   changed: (walked) from 62 to 105
   goals met: 0 of 20
3. (load-truck package13 truck1 s12)
   deleted: (at package13 s12)
   added: (in package13 truck1)
   goals met: 0 of 20
4. (load-truck package14 truck1 s12)
   deleted: (at package14 s12)
   added: (in package14 truck1)
   goals met: 0 of 20
5. (walk driver1 p11-12 s12)
   deleted: (at driver1 p11-12)
   added: (at driver1 s12)
   changed: (walked) from 105 to 185
   goals met: 0 of 20
6. (load-truck package2 truck1 s12)
   deleted: (at package2 s12)
   added: (in package2 truck1)
   goals met: 0 of 20
7. (board-truck driver1 truck1 s12)
   deleted: (at driver1 s12) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 0 of 20
8. (walk driver3 p5-7 s5)
   deleted: (at driver3 p5-7)
   added: (at driver3 s5)
   changed: (walked) from 185 to 258
   goals met: 1 of 20
9. (walk driver2 s1 p1-8)
   deleted: (at driver2 s1)
   added: (at driver2 p1-8)
   changed: (walked) from 258 to 293
   goals met: 1 of 20
10. (walk driver2 p1-8 s8)
   deleted: (at driver2 p1-8)
   added: (at driver2 s8)
   changed: (walked) from 293 to 336
   goals met: 1 of 20
11. (walk driver2 s8 p11-8)
   deleted: (at driver2 s8)
   added: (at driver2 p11-8)
   changed: (walked) from 336 to 365
   goals met: 1 of 20
12. (walk driver2 p11-8 s11)
   deleted: (at driver2 p11-8)
   added: (at driver2 s11)
   changed: (walked) from 365 to 404
   goals met: 2 of 20
13. (drive-truck truck1 s12 s9 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (driven) from 0 to 2
   goals met: 2 of 20
14. (drive-truck truck1 s9 s5 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s5)
   changed: (driven) from 2 to 5
   goals met: 2 of 20
15. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 2 of 20
16. (load-truck package3 truck1 s5)
   deleted: (at package3 s5)
   added: (in package3 truck1)
   goals met: 2 of 20
17. (drive-truck truck1 s5 s9 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s9)
   changed: (driven) from 5 to 8
   goals met: 2 of 20
18. (unload-truck package13 truck1 s9)
   deleted: (in package13 truck1)
   added: (at package13 s9)
   goals met: 3 of 20
19. (load-truck package15 truck1 s9)
   deleted: (at package15 s9)
   added: (in package15 truck1)
   goals met: 3 of 20
20. (walk driver4 s10 p6-10)
   deleted: (at driver4 s10)
   added: (at driver4 p6-10)
   changed: (walked) from 404 to 469
   goals met: 3 of 20
21. (walk driver4 p6-10 s6)
   deleted: (at driver4 p6-10)
   added: (at driver4 s6)
   changed: (walked) from 469 to 484
   goals met: 3 of 20
22. (walk driver4 s6 p6-0)
   deleted: (at driver4 s6)
   added: (at driver4 p6-0)
   changed: (walked) from 484 to 568
   goals met: 3 of 20
23. (walk driver4 p6-0 s0)
   deleted: (at driver4 p6-0)
   added: (at driver4 s0)
   changed: (walked) from 568 to 610
   goals met: 4 of 20
24. (drive-truck truck1 s9 s1 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (driven) from 8 to 95
   goals met: 4 of 20
25. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 5 of 20
26. (drive-truck truck1 s1 s6 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (driven) from 95 to 136
   goals met: 5 of 20
27. (load-truck package4 truck1 s6)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   goals met: 5 of 20
28. (load-truck package9 truck1 s6)
   deleted: (at package9 s6)
   added: (in package9 truck1)
   goals met: 5 of 20
29. (drive-truck truck1 s6 s11 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s11)
   changed: (driven) from 136 to 220
   goals met: 5 of 20
30. (load-truck package6 truck1 s11)
   deleted: (at package6 s11)
   added: (in package6 truck1)
   goals met: 5 of 20
31. (drive-truck truck1 s11 s12 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s12)
   changed: (driven) from 220 to 299
   goals met: 5 of 20
32. (unload-truck package4 truck1 s12)
   deleted: (in package4 truck1)
   added: (at package4 s12)
   goals met: 6 of 20
33. (drive-truck truck1 s12 s2 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s2)
   changed: (driven) from 299 to 324
   goals met: 6 of 20
34. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 6 of 20
35. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 324 to 353
   goals met: 6 of 20
36. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 7 of 20
37. (drive-truck truck1 s1 s8 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   changed: (driven) from 353 to 402
   goals met: 7 of 20
38. (unload-truck package15 truck1 s8)
   deleted: (in package15 truck1)
   added: (at package15 s8)
   goals met: 8 of 20
39. (load-truck package10 truck1 s8)
   deleted: (at package10 s8)
   added: (in package10 truck1)
   goals met: 8 of 20
40. (drive-truck truck1 s8 s1 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   changed: (driven) from 402 to 451
   goals met: 8 of 20
41. (unload-truck package10 truck1 s1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 9 of 20
42. (drive-truck truck1 s1 s6 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (driven) from 451 to 492
   goals met: 9 of 20
43. (drive-truck truck1 s6 s10 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s10)
   changed: (driven) from 492 to 569
   goals met: 9 of 20
44. (load-truck package11 truck1 s10)
   deleted: (at package11 s10)
   added: (in package11 truck1)
   goals met: 9 of 20
45. (unload-truck package9 truck1 s10)
   deleted: (in package9 truck1)
   added: (at package9 s10)
   goals met: 10 of 20
46. (drive-truck truck1 s10 s5 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s5)
   changed: (driven) from 569 to 653
   goals met: 10 of 20
47. (drive-truck truck1 s5 s9 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s9)
   changed: (driven) from 653 to 656
   goals met: 10 of 20
48. (drive-truck truck1 s9 s11 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s11)
   changed: (driven) from 656 to 708
   goals met: 10 of 20
49. (drive-truck truck1 s11 s0 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s0)
   changed: (driven) from 708 to 710
   goals met: 10 of 20
50. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 11 of 20
51. (drive-truck truck1 s0 s11 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s11)
   changed: (driven) from 710 to 712
   goals met: 11 of 20
52. (drive-truck truck1 s11 s8 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s8)
   changed: (driven) from 712 to 760
   goals met: 11 of 20
53. (load-truck package7 truck1 s8)
   deleted: (at package7 s8)
   added: (in package7 truck1)
   goals met: 11 of 20
54. (load-truck package12 truck1 s8)
   deleted: (at package12 s8)
   added: (in package12 truck1)
   goals met: 11 of 20
55. (drive-truck truck1 s8 s5 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (driven) from 760 to 826
   goals met: 11 of 20
56. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 826 to 917
   goals met: 12 of 20
57. (unload-truck package14 truck1 s3)
   deleted: (in package14 truck1)
   added: (at package14 s3)
   goals met: 13 of 20
58. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 14 of 20
59. (drive-truck truck1 s3 s7 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (driven) from 917 to 947
   goals met: 13 of 20
60. (load-truck package8 truck1 s7)
   deleted: (at package8 s7)
   added: (in package8 truck1)
   goals met: 13 of 20
61. (drive-truck truck1 s7 s2 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (driven) from 947 to 951
   goals met: 13 of 20
62. (drive-truck truck1 s2 s5 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 951 to 1000
   goals met: 13 of 20
63. (unload-truck package8 truck1 s5)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 14 of 20
64. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 1000 to 1091
   goals met: 15 of 20
65. (drive-truck truck1 s3 s4 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 1091 to 1177
   goals met: 14 of 20
66. (unload-truck package12 truck1 s4)
   deleted: (in package12 truck1)
   added: (at package12 s4)
   goals met: 15 of 20
67. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 1177 to 1261
   goals met: 15 of 20
68. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 1261 to 1284
   goals met: 15 of 20
69. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   goals met: 16 of 20
70. (drive-truck truck1 s6 s2 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 1284 to 1307
   goals met: 16 of 20
71. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 1307 to 1391
   goals met: 16 of 20
72. (unload-truck package11 truck1 s4)
   deleted: (in package11 truck1)
   added: (at package11 s4)
   goals met: 17 of 20
73. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 1391 to 1475
   goals met: 17 of 20
74. (drive-truck truck1 s2 s12 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s12)
   changed: (driven) from 1475 to 1500
   goals met: 17 of 20
75. (drive-truck truck1 s12 s9 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (driven) from 1500 to 1502
   goals met: 17 of 20
76. (unload-truck package6 truck1 s9)
   deleted: (in package6 truck1)
   added: (at package6 s9)
   goals met: 18 of 20
77. (drive-truck truck1 s9 s1 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (driven) from 1502 to 1589
   goals met: 18 of 20
78. (drive-truck truck1 s1 s3 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 1589 to 1610
   goals met: 19 of 20
79. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 19 of 20
80. (walk driver1 s3 p9-3)
   deleted: (at driver1 s3)
   added: (at driver1 p9-3)
   changed: (walked) from 610 to 660
   goals met: 19 of 20
81. (walk driver1 p9-3 s9)
   deleted: (at driver1 p9-3)
   added: (at driver1 s9)
   changed: (walked) from 660 to 664
   goals met: 20 of 20
